"use strict";

const questionAnswer = [
  {
    question: "السؤال 1: الحصول على الدهون في الجسم وفقدانها ، انقر فوق الاستجابة التي تنطبق عليك على أفضل وجه. عندما يتعلق الأمر باكتساب وخسارة الدهون، أجد...",
    a: "أكسب الدهون في الجسم بسهولة ولكن لدي مشكلة في خسارتها",
    b: "أجد صعوبة في وضع الدهون في الجسم",
    c: "أكتسب وأفقد الدهون في الجسم بسهولة مماثلة",
  },
  {
    question: "السؤال 2: بناء العضلات، انقر فوق الإجابة التي تنطبق عليك. عندما يتعلق الأمر ببناء العضلات، أجد ...",
    a: "لدي بعض العضلات ولكني أجد صعوبة في تحويل الدهون في الجسم إلى عضلات",
    b: "أجد صعوبة في بناء العضلات أو زيادة الوزن ",
    c: "لدي وقت سهل إلى حد ما في اكتساب العضلات",
  },
  {
    question: "السؤال 3: شكل الجسم، انقر فوق الإجابة التي تنطبق عليك. عندما يتعلق الأمر بشكل الجسم، أود أن أصف شكلي بأنه ...",
    a: "على شكل كمثرى (الوزن معظمه في الجزء السفلي من الجسم)",
    b: "مستطيلة (عدد أقل من المنحنيات بشكل عام)",
    c: "الساعة الرملية (منحنيات ذات إطار معتدل)",
  },
  {
    question: "السؤال 4: وصف الجسم، انقر فوق الإجابة التي تنطبق عليك بشكل أفضل. سأصف جسدي بأنه...",
    a: "ناعمة ومستديرة",
    b: "نحيل وبوني",
    c: "قوي وعضلي",
  },
  {
    question: "السؤال الخامس: تركيب عظام الجسم. انقر فوق الإجابة التي تنطبق عليك بشكل أفضل. أود أن أصف البنية العظمية في جسدي بأنها...",
    a: "أكبر مع إطار أوسع",
    b: "أصغر حجما مع إطار أطول",
    c: "متوسطة مع إطار متوسط",
  },
   {
    question: "السؤال السادس: التمرين. انقر فوق الرد الذي ينطبق عليك بشكل أفضل، عندما يتعلق الأمر بالتمرين، أجد ...",
    a: "التمارين تمثل تحديًا بالنسبة لي",
    b: "تمارين القلب تأتي بشكل طبيعي بالنسبة لي",
    c: "تدريب القوة ورفع الأثقال يأتي بشكل طبيعي بالنسبة لي",
  },
];

const submitBtn = document.querySelector(".btn");
const questions = document.getElementById("question");
const a_option = document.getElementById("a_option");
const b_option = document.getElementById("b_option");
const c_option = document.getElementById("c_option");
const allOptions = document.querySelectorAll(".answer");
const result = document.getElementById("result");

let questionCount = 0;
let answerStats = {
  a: 0,
  b: 0,
  c: 0,
};

quizeSetup();

function quizeSetup() {
  deselect();
  if (questionCount < questionAnswer.length) {
    questions.textContent = `${questionAnswer[questionCount].question}`;
    a_option.textContent = `${questionAnswer[questionCount].a}`;
    b_option.textContent = `${questionAnswer[questionCount].b}`;
    c_option.textContent = `${questionAnswer[questionCount].c}`;
  } else {
    calculateBodyType();
  }
}

function deselect() {
  allOptions.forEach((option) => {
    option.checked = false;
  });
}

function optionSelected() {
  let answer = undefined;
  allOptions.forEach((option) => {
    if (option.checked) {
      answer = option.id;
    }
  });
  return answer;
}

submitBtn.addEventListener("click", () => {
  const finalAnswer = optionSelected();

  if (finalAnswer) {
    updateAnswerStats(finalAnswer);
    questionCount++;

    quizeSetup();
  }
});

function updateAnswerStats(answer) {
  // Increment the respective answer count in the answerStats object
  if (answer === 'a') {
    answerStats.a++;
  } else if (answer === 'b') {
    answerStats.b++;
  } else if (answer === 'c') {
    answerStats.c++;
  }
}


function calculateBodyType() {
  // Calculation logic remains the same
  const totalQuestions = questionAnswer.length;
const percentageA = (answerStats.a / totalQuestions) * 100;
const percentageB = (answerStats.b / totalQuestions) * 100;
const percentageC = (answerStats.c / totalQuestions) * 100;

let bodyType = "";

if (percentageA > 60 && percentageA > percentageB && percentageA > percentageC) {
  bodyType = "بناءً على إجاباتك، فإن جسمك يشبه إلى حد كبير نوع الجسم الداخلي. عادةً ما يكون لدى الأشخاص الذين يتمتعون بهذا النوع من الجسم خصر عريض ووركين وعظام أكبر. قد يعني هذا أنك تكتسب الوزن بسهولة وتخزن الدهون في الجسم، خاصة على الوركين والفخذين والمعدة. قد يرغب الأشخاص الذين لديهم نوع الجسم الداخلي الذين يتطلعون إلى تقليل بعض الدهون في الجسم في التركيز على الحصول على ما يكفي من البروتين في نظامهم الغذائي ودمج تمارين القلب في روتين تمارينهم الرياضية.";
} else if (percentageB > 60 && percentageB > percentageA && percentageB > percentageC) {
  bodyType = "بناءً على ردودك، فإن جسمك يشبه إلى حد كبير نوع الجسم ظاهري البنية. يميل الأشخاص الذين يتمتعون بهذا النوع من الجسم إلى أن يكونوا طويلين ونحيفين مع القليل من الدهون أو العضلات في الجسم. من المحتمل أن يشبه إطارك مستطيلًا مع منحنيات أقل. قد يرغب الأشخاص ذوو نوع الجسم ظاهري البنية الذين يتطلعون إلى زيادة الوزن أو العضلات في التركيز على زيادة السعرات الحرارية، وتناول عدة وجبات أصغر على مدار اليوم، ودمج الكربوهيدرات المعقدة وكميات معتدلة من البروتين في نظامهم الغذائي.";
} else if (percentageC > 60 && percentageC > percentageA && percentageC > percentageB) {
  bodyType = "بناءً على ردودك، فإن جسمك يشبه إلى حد كبير نوع الجسم المتوسط. يميل الأشخاص ذوو هذا النوع من الجسم إلى أن يكونوا أكثر عضلات وذو إطار معتدل. لديهم عمومًا خصر أصغر مع بعض المنحنيات على أجسادهم. تتميز أنواع الأجسام Mesomorph بسرعة اكتساب العضلات وتجد أن اكتساب الدهون في الجسم وفقدانها أسهل من أنواع الجسم الأخرى. قد يجد الأشخاص ذوو نوع الجسم المتوسط البنية أن تدريبات القوة وتمارين القلب وتناول نظام غذائي متوازن من البروتينات الخالية من الدهون والدهون الصحية والكربوهيدرات المعقدة — مثل الحبوب الكاملة والفواكه والخضروات — هي الأفضل لنوع جسمهم وأسلوب حياتهم.";
} else {
  // If none of the options dominate by more than 60%, consider a mix
  if (percentageA >= 60) {
  bodyType = "بناءً على إجاباتك، فإن جسمك يشبه إلى حد كبير نوع الجسم الداخلي. عادةً ما يكون لدى الأشخاص الذين يتمتعون بهذا النوع من الجسم خصر عريض ووركين وعظام أكبر. قد يعني هذا أنك تكتسب الوزن بسهولة وتخزن الدهون في الجسم، خاصة على الوركين والفخذين والمعدة. قد يرغب الأشخاص الذين لديهم نوع الجسم الداخلي الذين يتطلعون إلى تقليل بعض الدهون في الجسم في التركيز على الحصول على ما يكفي من البروتين في نظامهم الغذائي ودمج تمارين القلب في روتين تمارينهم الرياضية.";
  }
  if (percentageB >= 60) {
    bodyType = "بناءً على ردودك، فإن جسمك يشبه إلى حد كبير نوع الجسم ظاهري البنية. يميل الأشخاص الذين يتمتعون بهذا النوع من الجسم إلى أن يكونوا طويلين ونحيفين مع القليل من الدهون أو العضلات في الجسم. من المحتمل أن يشبه إطارك مستطيلًا مع منحنيات أقل. قد يرغب الأشخاص ذوو نوع الجسم ظاهري البنية الذين يتطلعون إلى زيادة الوزن أو العضلات في التركيز على زيادة السعرات الحرارية، وتناول عدة وجبات أصغر على مدار اليوم، ودمج الكربوهيدرات المعقدة وكميات معتدلة من البروتين في نظامهم الغذائي.";
  }
  if (percentageC >= 60) {
    bodyType = "بناءً على ردودك، فإن جسمك يشبه إلى حد كبير نوع الجسم المتوسط. يميل الأشخاص ذوو هذا النوع من الجسم إلى أن يكونوا أكثر عضلات وذو إطار معتدل. لديهم عمومًا خصر أصغر مع بعض المنحنيات على أجسادهم. تتميز أنواع الأجسام Mesomorph بسرعة اكتساب العضلات وتجد أن اكتساب الدهون في الجسم وفقدانها أسهل من أنواع الجسم الأخرى. قد يجد الأشخاص ذوو نوع الجسم المتوسط البنية أن تدريبات القوة وتمارين القلب وتناول نظام غذائي متوازن من البروتينات الخالية من الدهون والدهون الصحية والكربوهيدرات المعقدة - مثل الحبوب الكاملة والفواكه والخضروات - هي الأفضل لنوع جسمهم وأسلوب حياتهم.";
  }
  if (bodyType === "") {
    // If none of the options crossed 60%, pick the highest one
    const maxPercentage = Math.max(percentageA, percentageB, percentageC);
    if (maxPercentage === percentageA) {
      bodyType = "بناءً على إجاباتك، فإن جسمك يشبه إلى حد كبير نوع الجسم الداخلي. عادةً ما يكون لدى الأشخاص الذين يتمتعون بهذا النوع من الجسم خصر عريض ووركين وعظام أكبر. قد يعني هذا أنك تكتسب الوزن بسهولة وتخزن الدهون في الجسم، خاصة على الوركين والفخذين والمعدة. قد يرغب الأشخاص الذين لديهم نوع الجسم الداخلي الذين يتطلعون إلى تقليل بعض الدهون في الجسم في التركيز على الحصول على ما يكفي من البروتين في نظامهم الغذائي ودمج تمارين القلب في روتين تمارينهم الرياضية.";
    } else if (maxPercentage === percentageB) {
      bodyType = "بناءً على ردودك، فإن جسمك يشبه إلى حد كبير نوع الجسم ظاهري البنية. يميل الأشخاص الذين يتمتعون بهذا النوع من الجسم إلى أن يكونوا طويلين ونحيفين مع القليل من الدهون أو العضلات في الجسم. من المحتمل أن يشبه إطارك مستطيلًا مع منحنيات أقل. قد يرغب الأشخاص ذوو نوع الجسم ظاهري البنية الذين يتطلعون إلى زيادة الوزن أو العضلات في التركيز على زيادة السعرات الحرارية، وتناول عدة وجبات أصغر على مدار اليوم، ودمج الكربوهيدرات المعقدة وكميات معتدلة من البروتين في نظامهم الغذائي.";
    } else {
    bodyType = "بناءً على ردودك، فإن جسمك يشبه إلى حد كبير نوع الجسم المتوسط. يميل الأشخاص ذوو هذا النوع من الجسم إلى أن يكونوا أكثر عضلات وذو إطار معتدل. لديهم عمومًا خصر أصغر مع بعض المنحنيات على أجسادهم. تتميز أنواع الأجسام Mesomorph بسرعة اكتساب العضلات وتجد أن اكتساب الدهون في الجسم وفقدانها أسهل من أنواع الجسم الأخرى. قد يجد الأشخاص ذوو نوع الجسم المتوسط البنية أن تدريبات القوة وتمارين القلب وتناول نظام غذائي متوازن من البروتينات الخالية من الدهون والدهون الصحية والكربوهيدرات المعقدة - مثل الحبوب الكاملة والفواكه والخضروات - هي الأفضل لنوع جسمهم وأسلوب حياتهم.";
    }
  } else {
    bodyType += "(Mixed)";
  }
}

displayBodyType(bodyType);
}

function displayBodyType(bodyType) {
  result.innerHTML = `<h1> ${bodyType}</h1>`;
}


